Revit 2027 API
Frame.BasisX Property
 The first basis vector of the frame.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ BasisX { get; set; }
Public Property BasisX As XYZ
	Get
	Set
public:
property XYZ^ BasisX {
	XYZ^ get ();
	void set (XYZ^ value);
}
member BasisX : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Frame Class
Autodesk.Revit.DB Namespace